const jobs = [
    {
        jobTitle: "فني التكييف",
        employees: [
            { id: 50, name: "ديبانكار موندال", location: "قسم الصيانة", job: "فني تكييف", date: "2023-07-01", visa: "اقامة على الشركة", salary: 1600 },
            { id: 822, name: "سوميش", location: "قسم الصيانة", job: "فني تكييف", date: "2022-11-13", visa: "اقامة على الشركة", salary: 2400 },
            { id: 311, name: "عارف اللّٰه شيخ", location: "قسم الصيانة", job: "فني تكييف", date: "2024-09-01", visa: "اقامة على الشركة", salary: 1400 },
            { id: 713, name: "لا يوجد مساعد", location: "قسم الصيانة", job: "مساعد تكييف", date: "2022-04-13", visa: "اقامة على الشركة", salary: 1200 },
            { id: 782, name: "نيدهيش ديفاناندان", location: "قسم الصيانة", job: "فني تكييف", date: "2022-09-25", visa: "اقامة على الشركة", salary: 2200 },
            { id: 337, name: "قيجاى رامان", location: "عجمان D-04", job: "فني تكييف", date: "2019-07-01", visa: "اقامة على الشركة", salary: 1800 },
            { id: 71, name: "جوزيف وايو", location: "عجمان D-04", job: "فني تكييف", date: "2023-11-12", visa: "اقامة على الشركة", salary: 1100 },
            { id: 368, name: "روبين كريشنا", location: "عجمان D-04", job: "فني تكييف", date: "2019-10-08", visa: "اقامة على الشركة", salary: 2700 },
            { id: 563, name: "عرفات محمود", location: "عجمان D-04", job: "فني تكييف", date: "2021-07-01", visa: "اقامة على الشركة", salary: 1400 },
            { id: 53, name: "حمادة عبد اللّٰه رزق", location: "عجمان D-04", job: "فني تكييف", date: "2007-12-12", visa: "اقامة على الشركة", salary: 2400 },
            { id: 489, name: "ارون كومار", location: "عجمان D-04", job: "فني تكييف", date: "2024-05-21", visa: "اقامة على الشركة", salary: 1300 },
        ]
    },
    {
        jobTitle: "حداد مسلح",
        employees: [
            { id: 183, name: "لال محمد محمد رحمن", location: "عجمان D-04", job: "حداد مسلح", date: "2025-02-20", visa: "اقامة على الشركة", salary: 1700 },
            { id: 201, name: "رامبرافيس ماوريا فيجاي", location: "عجمان D-04", job: "حداد مسلح", date: "2025-01-05", visa: "اقامة على الشركة", salary: 1400 },
            { id: 202, name: "روحان كومار", location: "عجمان D-04", job: "حداد مسلح", date: "2025-01-04", visa: "اقامة على الشركة", salary: 1400 },
            { id: 212, name: "والي محمد نور محمد", location: "عجمان D-04", job: "حداد مسلح", date: "2025-01-05", visa: "اقامة على الشركة", salary: 1400 },
            { id: 213, name: "فينود ياداف", location: "عجمان D-04", job: "حداد مسلح", date: "2025-01-07", visa: "اقامة على الشركة", salary: 1400 },
            { id: 215, name: "سكلديب كومار موتى رام", location: "عجمان D-04", job: "حداد مسلح", date: "2025-01-05", visa: "اقامة على الشركة", salary: 1400 },
            { id: 221, name: "برنس كومار", location: "عجمان D-04", job: "حداد مسلح", date: "2025-01-16", visa: "اقامة على الشركة", salary: 1400 },
            { id: 234, name: "سانتوش كومار", location: "عجمان D-04", job: "حداد مسلح", date: "2025-01-07", visa: "اقامة على الشركة", salary: 1400 },
            { id: 245, name: "اندريش ياداف", location: "عجمان D-04", job: "حداد مسلح", date: "2025-01-02", visa: "اقامة على الشركة", salary: 1400 },
            { id: 249, name: "شاني كومار", location: "عجمان D-04", job: "حداد مسلح", date: "2025-01-07", visa: "اقامة على الشركة", salary: 1400 },
            { id: 252, name: "جيتندرا سهاني رام", location: "عجمان D-04", job: "حداد مسلح", date: "2025-01-22", visa: "اقامة على الشركة", salary: 1400 },
            { id: 315, name: "شارنجيت سينغ", location: "عجمان D-04", job: "حداد مسلح", date: "2025-02-02", visa: "اقامة على الشركة", salary: 1400 },
            { id: 318, name: "نواج شريف", location: "عجمان D-04", job: "حداد مسلح", date: "2025-02-02", visa: "اقامة على الشركة", salary: 1400 },
            { id: 357, name: "براديب كومار", location: "عجمان D-04", job: "حداد مسلح", date: "2025-02-04", visa: "اقامة على الشركة", salary: 1400 },
            { id: 361, name: "مرشد علم", location: "عجمان D-04", job: "حداد مسلح", date: "2025-02-04", visa: "اقامة على الشركة", salary: 1400 },
            { id: 369, name: "غوفيندا باسوان", location: "عجمان D-04", job: "حداد مسلح", date: "2025-02-04", visa: "اقامة على الشركة", salary: 1400 },
            { id: 374, name: "دهانو كومار", location: "عجمان D-04", job: "حداد مسلح", date: "2025-02-04", visa: "اقامة على الشركة", salary: 1400 },
            { id: 40, name: "ماينجير ياداف", location: "عجمان D-04", job: "حداد مسلح", date: "2008-02-13", visa: "اقامة على الشركة", salary: 2200 },
            { id: 290, name: "محمد رياض", location: "عجمان D-04", job: "حداد مسلح", date: "2019-02-01", visa: "اقامة على الشركة", salary: 1300 },
            { id: 164, name: "راتنيش جاسوال", location: "عجمان D-04", job: "حداد مسلح", date: "2017-03-01", visa: "اقامة على الشركة", salary: 1200 },
            { id: 266, name: "انسو كومار", location: "عجمان D-04", job: "حداد مسلح", date: "2025-01-07", visa: "اقامة على الشركة", salary: 1400 }

        ]
    },
    {
        jobTitle: "فورمان",
        employees: [
            { id: 23, name: "عبد المقصود غلام", location: "عجمان D-04", job: "فورمان", date: "2025-01-22", visa: "اقامة على الشركة", salary: 4500 },
            { id: 239, name: "دهارمندرا باسوان", location: "عجمان D-04", job: "فورمان", date: "2019-07-23", visa: "اقامة على الشركة", salary: 2200 },
            { id: 354, name: "عامر جميل", location: "عجمان D-04", job: "فورمان", date: "2019-08-10", visa: "اقامة على الشركة", salary: 1800 },
            { id: 367, name: "لوغاناثان", location: "عجمان D-04", job: "فورمان", date: "2019-08-10", visa: "اقامة على الشركة", salary: 3000 },
            { id: 74, name: "اروموجام راجيندران", location: "عجمان D-04", job: "فورمان", date: "2003-07-17", visa: "اقامة على الشركة", salary: 1500 }
        ]
    },
    {
        jobTitle: "لحام",
        employees: [
            { id: 697, name: "رياض الدين", location: "عجمان D-4", job: "لحام", date: "2022-03-12", visa: "اقامة على الشركة", salary: 1300 },
            { id: 216, name: "طيب الانصاري", location: "عجمان D-4", job: "لحام", date: "2025-01-16", visa: "اقامة على الشركة", salary: 1400 },
            { id: 390, name: "ازماتو لا شيخ اميندين شيح", location: "عجمان D-4", job: "لحام", date: "2025-01-09", visa: "اقامة على الشركة", salary: 1350 },
            { id: 712, name: "محمد سوهيل", location: "مشروع ابو شغارة", job: "لحام", date: "2022-04-12", visa: "لا يوجد", salary: 1200 }
        ]
    },
    {
        jobTitle: "بناء",
        employees: [
            { id: 222, name: "فيملا رامو بافان", location: "عجمان 04-D", job: "بناء / بلاط", date: "2025-01-26", visa: "افامة علی الشرکة", salary: 1600 },
            { id: 238, name: "ساربجیت سینغ بریم سینغ", location: "عجمان 04-D", job: "بناء", date: "2025-01-05", visa: "افامة على الشركة", salary: 1400 },
            { id: 244, name: "راجیندر سینغ هاردیب", location: "عجمان 04-D", job: "بناء", date: "2025-01-10", visa: "افامة على الشركة", salary: 1400 },
            { id: 306, name: "بهارات براساد", location: "عجمان 04-D", job: "بناء", date: "2019-04-01", visa: "افامة على الشركة", salary: 1300 },
            { id: 323, name: "احمد مجاهد فهمی", location: "عجمان 04-D", job: "بناء", date: "2024-07-01", visa: "افامة علی الشرکة", salary: 1900 },
            { id: 335, name: "احمد على محمد", location: "عجمان 04-D", job: "بناء", date: "2024-08-01", visa: "افامة علی الشرکة", salary: 1900 },
            { id: 340, name: "محمد يحي", location: "عجمان 04-D", job: "بناء", date: "2024-08-01", visa: "افامة علی الشرکة", salary: 1900 },
            { id: 419, name: "احمد عبدالموجود بكر حسن", location: "عجمان 04-D", job: "بناء", date: "2024-12-01", visa: "افامة علی الشرکة", salary: 2000 },
            { id: 421, name: "محمد أحمد محمدی", location: "عجمان 04-D", job: "بناء", date: "2024-12-01", visa: "افامة على الشركة", salary: 2000 },
            { id: 428, name: "محمد احمد عطية السيد", location: "عجمان 04-D", job: "بناء", date: "2024-12-01", visa: "افامة على الشرکة", salary: 2000 },
            { id: 166, name: "رفيق الاسلام عبد الخالق", location: "عجمان 04-D", job: "بناء", date: "2009-07-23", visa: "افامة على الشركة", salary: 1400 },
            { id: 280, name: "کاري ميا", location: "عجمان 04-D", job: "بناء", date: "2025-04-02", visa: "افامة علی الشرکة", salary: 1600 },
            { id: 313, name: "غنيشا رام مجوال", location: "عجمان 04-D", job: "بناء", date: "2025-02-02", visa: "افامة على الشركة", salary: 1400 },
            { id: 322, name: "راهول كیلاش", location: "عجمان 04-D", job: "بناء", date: "2025-04-02", visa: "افامة علی الشرکة", salary: 1400 },
            { id: 336, name: "کرشنا قنایا", location: "عجمان 04-D", job: "بناء / بلاط", date: "2025-01-02", visa: "افامة علی الشرکة", salary: 1600 },
            { id: 344, name: "صافی علم حافجی", location: "عجمان 04-D", job: "بناء", date: "2025-04-02", visa: "افامة على الشركة", salary: 1600 },
            { id: 355, name: "سودهاکار کومار", location: "عجمان 04-D", job: "بناء", date: "2025-01-02", visa: "افامة على الشركة", salary: 1300 },
            { id: 379, name: "شاتو انیرود", location: "عجمان 04-D", job: "بناء", date: "2025-04-02", visa: "افامة على الشركة", salary: 1300 },
            { id: 393, name: "ریاس الدین علي", location: "عجمان 04-D", job: "بناء", date: "2025-02-04", visa: "افامة على الشرکة", salary: 1400 },
            { id: 351, name: "غورمیت کومار", location: "عجمان 04-D", job: "بناء / بلاط", date: "2025-01-02", visa: "افامة علی الشرکة", salary: 1600 },
            { id: 776, name: "برايت أوبينج", location: "عجمان 04-D", job: "بناء", date: "2022-09-19", visa: "افامة على الشركة", salary: 1500 },
            { id: 375, name: "انجان یلو سرید", location: "عجمان 04-D", job: "بناء", date: "2025-02-01", visa: "افامة علی الشرکة", salary: 1400 }
            { id: 317, name: "استانلى اوسى", location: "صيانة", job: "بناء", date: "2024-01-25", visa: "افامة علی الشرکة", salary: 1200 },
            { id: 93, name: "سويل حسين", location: "صيانة", job: "بناء", date: "2011-10-05", visa: "افامة علی الشرکة", salary: 1350 },
            { id: 74, name: "اروموجام راجيندار", location: "مشروع ابو شغارة", job: "بناء", date: "2003-07-17", visa: "افامة علی الشرکة", salary: 1500 }
        ]
    }
];

localStorage.setItem("employees", JSON.stringify(jobs)); // Store initial data if not set
